var templateArticles= [];
templateArticle= {};
templateArticle.URL= 'https://techblog.gr/b2b/apple-record-quarter-profits-2722/';
templateArticle.Title= 'H Apple σπάει ρεκόρ κερδών για το τέταρτο οικονομικό τρίμηνο';
templateArticle.PictureSrc= './templateArticles/TempArticlePicture.jpg';
templateArticle.Content= 'Μαζί με την επίσημη κυκλοφορία του επετειακού iPhone X, η Apple ανακοίνωσε εχθές τα κέρδη τριμήνου καταφέρνοντας να ξεπεράσει τις προσδοκίες της Wall Street. Το τμήμα Υπηρεσιών της κατάφερε να κάνει το καλύτερο τρίμηνο ever.\n\nΚατά τη διάρκεια Ιουλίου – Σεπτεμβρίου, η Apple πούλησε 46.7 εκατ. iPhone και τα έσοδα που σχετίζονται με τα smartphones ανήλθαν σε 28.85 δισ. δολάρια. Την ίδια περίοδο πέρσι, οι πωλήσεις iPhones ήταν στα 45.5 εκατ. με έσοδα 28.16 δισ. δολάρια.\n\nH Apple κατάφερε επίσης να ανεβάσει και τις πωλήσεις iPads, από 9.27 εκατ. πέρσι, φέτος έφτασαν τα 10.3 εκατ. με έσοδα 4.83 δισ. δολάρια και αύξηση 14%.\n\nΤο τμήμα Υπηρεσιών που περιλαμβάνει iTunes, Apple Pay and the App Store, ήταν αυτό που έσπασε ρεκόρ τριμήνου με έσοδα 8.5 δισ. δολάρια.\n\nΣυνολικά η Apple ανακοίνωσε 10.7 δισ. δολάρια σε καθαρά κέρδη για το τέταρτο τρίμηνο του οικονομικού της έτους με κέρδη 2.07 δολάρια ανά μετοχή. Οι εκτιμήσεις της Wall Street ήταν 1.87 δολάρια ανά μετοχή. Τα έσοδα αυξήθηκαν κατά 12% στα 52.6 δισ. δολάρια. Το ίδιο τρίμηνο πέρσι, η Apple είχε έσοδα 46.9 δολάρια (1.67 ανά μετοχή).\n\nΓια το επόμενο τρίμηνο, που περιλαμβάνει Thanksgiving, Black Friday και Χριστούγεννα, η Apple αναμένει σημαντική άνοδο με έσοδα 84-87 δισ. δολαρίων και μικτό περιθώριο κέρδους 38%.\n\nΜετά την ανακοίνωση των αποτελεσμάτων, η μετοχή της Apple ανέβηκε κατά 5% στα 174 δολάρια, αυτό σημαίνει ότι σημείωσε νέο ρεκόρ και η Apple είναι ένα βήμα πιο κοντά στο να γίνει η πρώτη εταιρεία αξίας 1 τρις. δολαρίων. Αυτή τη στιγμή είναι στα 900 δισ. δολάρια.';
templateArticle.Author= 'Λορένα Σιούτη';
templateArticle.Date= '04/11/2017';
templateArticle.SourceWebsite= 'www.techblog.gr';
templateArticle.Category= 'Technology';

templateArticles.push(templateArticle);

templateArticle= {};
templateArticle.URL= 'https://techblog.gr/mobile/apple-iphone-x-sold-out-in-three-minutes-in-south-korea-3881/';
templateArticle.Title= 'Apple iPhone X: Ξεπούλησε ταχύτατα στην Νότια Κορέα';
templateArticle.PictureSrc= './templateArticles/iPhone-X-hands.jpg';
templateArticle.Content= 'Το iPhone X έχει γίνει ανάρπαστο παγκοσμίως, κάτι που δικαιολογεί και την μεγάλη έλλειψη αποθέματος. Μπορεί όσο περνάει ο καιρός η αγορά του επετειακού μοντέλου να γίνεται πιο εύκολη, δεν παύει όμως να ξεπουλάει σε μερικές αγορές του κόσμου. Τελευταία ήταν η Νότια Κορέα, μητέρα πατρίδα των Samsung και LG. Σε ένα κράτος του οποίου τα εγχώρια smartphones κατακτούν τον πλανήτη, θα περίμενε κανείς πως οι κάτοικοι προτιμούν τις συσκευές που οι ίδιοι (οι οι συμπολίτες τους) κατασκευάζουν. Αυτό δεν φαίνεται να ισχύει στην περίπτωση της Νότιας Κορέας, χώρας από την οποία προέρχονται οι Samsung / LG και κατά συνέπεια τα κινητά τους τηλέφωνα. Με προτάσεις όπως τα Galaxy S8 / S8+, Note 8 ή V30, οι Κορεάτες έχουν παράδοση στην κατασκευή high-end smartphones. Φυσικά, διαθέτουν επίσης ανταγωνιστικά μοντέλα τόσο στην mid-range, όσο και στην low-budget κατηγορία. Όσο καλές και αν είναι οι συσκευές τους όμως, αρκετοί προτιμούν τον μεγάλο αντίπαλο, την Apple, και φέτος συγκεκριμένα το iPhone X. Μάλιστα, η ζήτηση για το επετειακό iPhone όχι μόνο ήταν μεγάλη, αλλά οδήγησε σε πλήρες ξεπούλημα του διαθέσιμου αποθέματος μέσα σε μόλις τρια λεπτά. Σύμφωνα με τον μεγαλύτερο πάροχο τηλεφωνίας της Νότιας Κορέας, την SK Telecom, η ασημένια έκδοση του iPhone X ξεπούλησε μέσα σε ένα λεπτό (!), ενώ εκείνη με την μαύρη πλάτη “έφυγε” τα επόμενα δυο λεπτά. Συνολικά διαθέσιμα υπήρχαν 150 χιλιάδες μοντέλα, τα μισά από τον συνολικό αριθμό των iPhone 8 / 8 Plus όταν αρχικά διατέθηκαν στο κοινό. Σύμφωνα με αναλυτές, το ενδιαφέρον γύρω από τις δυο iPhone 8 εκδόσεις την Νότια Κορέα έπεσε κατά 30-40% συγκριτικά με τα iPhone 7 / 7 Plus την περασμένη χρονιά, με το iPhone X να θεωρείται ο κύριος υπαίτιος, κάτι που τελικά αποδείχθηκε από τον ταχύτατο ρυθμό με τον οποίο ξεπούλησαν οι ομώνυμες παρτίδες. Φαίνεται πως παρά την προσπάθεια των Samsung και LG να πείσουν τις αγορές των Η.Π.Α. και Ευρώπης να προτιμήσουν τα δικά τους smartphones έναντι (κυρίως) των προτάσεων της Apple, τελικά ακόμα και οι εγχώριοι καταναλωτές έχουν… κατά βάθος μια μικρή συμπάθεια για τα προϊόντα του κολοσσού του Cupertino.';
templateArticle.Author= 'Λορένα Σιούτη';
templateArticle.Date= '17/11/2017';
templateArticle.SourceWebsite= 'www.techblog.gr';
templateArticle.Category= 'Technology';

templateArticles.push(templateArticle);

templateArticle= {};
templateArticle.URL= 'https://techblog.gr/mobile/apple-iphone-x-now-works-in-cold-weather-2348/';
templateArticle.Title= 'Apple iPhone X: Πλέον λειτουργεί και σε κρύο περιβάλλον';
templateArticle.PictureSrc= './templateArticles/iPhone-X-revealed01.jpg';
templateArticle.Content= 'Το iPhone X είναι διαθέσιμο σε περιορισμένο απόθεμα εδώ και μερικές ημέρες. Μέχρι στιγμής, εκατομμύρια καταναλωτές ανά τον κόσμο έχουν δείξει την προτίμηση τους στο νέο smartphone, από το οποίο όμως δεν λείπουν μικρά προβλήματα και δυσλειτουργίες, όπως πια συμβαίνει σε κάθε high-end smartphone που… σέβεται τον εαυτό του. Ένα εκ των ζητημάτων που είχαν προκύψει ήταν η αδυναμία πολλών κατόχων να χρησιμοποιήσουν την συσκευή σε περιβάλλον με χαμηλή θερμοκρασία. Η οθόνη δεν ανταποκρίνονταν στις εντολές που έδινε ο χρήστης με το δάχτυλο του και ουσιαστικά το κινητό δεν μπορούσε να προχωρήσει στην επιτέλεση λειτουργιών. Η Apple δήλωσε πως είναι ενήμερη για το θέμα και υποσχέθηκε να φέρει την λύση μέσω ενημέρωσης λογισμικού. Η ενημέρωση αυτή είναι το iOS 11.1.2 και διατίθεται πλέον για λήψη. Συγκεκριμένα, το 11.1.2 περιέχει μόνο διορθώσεις, οι οποίες μάλιστα αφορούν μόνο το iPhone X. Η μια είναι η προαναφερθείσα, ενώ η δεύτερη αφορά μια αλλοίωση που παρατηρούνταν στην ποιότητα της λήψης Live Photos και βίντεο από το επετειακό smartphone του Cupertino. Φαίνεται πως δεν υπάρχει άλλη βελτίωση που έρχεται μαζί με την νεότερη έκδοση του iOS, αλλά καλό είναι να εγκατασταθεί σε όλες τις Apple συσκευές, ανεξάρτητα από το αν εκείνη απευθύνεται κυρίως στο X. Η αλήθεια είναι πως το iPhone X δεν έχει παρουσιάσει σοβαρά και μεγάλα προβλήματα μέχρι τώρα. Οι πράσινες κάθετες γραμμές που εμφανίστηκαν σε μια παρτίδα δεν επηρεάζουν μεγάλο αριθμό χρηστών και σε γενικές γραμμές η κυκλοφορία του smartphone, που λόγω τόσων αλλαγών συγκριτικά με τους προκατόχους του θα δικαιολογούσε δυσλειτουργίες (όσο μπορούν να δικαιολογηθούν), κυλάει ομαλά. Βέβαια είναι ακόμα νωρίς, ενδέχεται να έρθουν στην επιφάνεια άλλα προβλήματα με την πάροδο του χρόνου, ένα εξ’ αυτών θα μπορούσε να είναι το πρόωρο burn-in της οθόνης. Η αξιοπιστία του iPhone X θα αποδειχθεί στο μέλλον.';
templateArticle.Author= 'Λορένα Σιούτη';
templateArticle.Date= '17/11/2017';
templateArticle.SourceWebsite= 'www.techblog.gr';
templateArticle.Category= 'Technology';

templateArticles.push(templateArticle);

templateArticle= {};
templateArticle.URL= 'https://techblog.gr/mobile/iphone-x-waiting-time-2-to-3-weeks-7213/';
templateArticle.Title= 'iPhone X: Στις 2-3 εβδομάδες ο χρόνος αναμονής';
templateArticle.PictureSrc= './templateArticles/iphonexfamly-TA.jpg';
templateArticle.Content= 'Το iPhone X είναι από τα πιο πολυσυζητημένα μοντέλα της Apple, μιας και η ίδια μπαίνει σε μια νέα εποχή με την αλλαγή στο design. Ανακοινώθηκε Σεπτέμβριο, αλλά οι πωλήσεις ξεκίνησαν στις 3 Νοεμβρίου, αλλά η ζήτηση ήταν αρκετά μεγάλη. Η ζήτηση (που ξεπέρασε τις προσδοκίες της Apple) σε συνδυασμό με τα διάφορα προβλήματα που λέγεται ότι είχε η Apple κατά την παραγωγή, ανέβασαν τους χρόνους αναμονής για το iPhone X στις 5-6 εβδομάδες. Ωστόσο, πλέον όσοι παραγγείλουν το iPhone X, σύμφωνα με τις εκτιμήσεις της Apple ο χρόνος αναμονής πέφτει πλέον στις 2-3 εβδομάδες. Φαίνεται πως η Apple καταφέρνει να βρει μια καλύτερη ισορροπία όσον αφορά στην ζήτηση και την παραγωγή. Το iPhone X διατίθεται σε Space Gray ή Silver με ενσωματωμένη μνήμη 64GB ή 256GB και την τιμή του στην Ελλάδα να είναι 1199 ευρώ και 1399 ευρώ, αντίστοιχα. Τις τρεις πρώτες μέρες, οι παραγγελίες του iPhone X εκτιμάται ότι έφτασαν τα 9-12 εκατ. Θα έχει ενδιαφέρον να δούμε πόσος θα είναι ο συνολικός αριθμός πωλήσεων για τ τρίμηνο.';
templateArticle.Author= 'Λορένα Σιούτη';
templateArticle.Date= '16/11/2017';
templateArticle.SourceWebsite= 'www.techblog.gr';
templateArticle.Category= 'Technology';

templateArticles.push(templateArticle);

templateArticle= {};
templateArticle.URL= 'https://techblog.gr/computers/china-has-more-supercomputers-than-anyone-2720/';
templateArticle.Title= 'Η Κίνα έχει τους περισσότερους υπερυπολογιστές στον πλανήτη';
templateArticle.PictureSrc= './templateArticles/supercomputers.jpg';
templateArticle.Content= 'Η Κίνα είναι αυτή που έχει πλέον τους περισσότερους υπερυπολογιστές από κάθε άλλη χώρα στον πλανήτη. Οι Κινέζοι παίρνουν την πρωτιά από τις ΗΠΑ στην λίστα με τους 500 ισχυρότερους supercomputers στον κόσμο. Πριν από ένα εξάμηνο, οι ΗΠΑ ήταν στην πρώτη θέση με 169 supercomputers, ενώ η Κίνα είχε 10 λιγότερους (159). Ωστόσο, μέσα σε πολύ μικρό χρονικό διάστημα οι Κινέζοι κατάφεραν να φτάσουν στους 202 και οι ΗΠΑ έπεσαν στους 144. Μετά τις ΗΠΑ και την Κίνα, οι οποίες προηγούνται αρκετά, τρίτη είναι η Ιαπωνία με 35 υπερυπολογιστές, ακολουθεί η Γερμανία με 20, η Γαλλία με 18 στην 5η θέση και η Βρετανία με 15. Για πρώτη φορά και οι δέκα ισχυρότεροι υπερυπολογιστές έχουν ο καθένας ισχύ άνω των 10 petaflops. Στην κορυφή βρίσκεται ο κινεζικός Sunway TaihuLight με επεξεργαστική ισχύ 93 petaflops/sec (χίλια τρισεκατομμύρια υπολογισμοί ανά δευτερόλεπτο). Δεύτερος είναι ο κινεζικός Tianhe-2 (33,9 petaflop/sec),στην τρίτη θέση είναι ο ελβετικός Piz Daint (19,6 petaflop/sec, ο πιο ισχυρός ευρωπαϊκός υπερυπολογιστής), ο ιαπωνικός Gyoukou (19,1 petaflop/sec) και ο αμερικανικός Titan (17,6 petaflop/sec) κλείνουν την πεντάδα. Τα supercomputers είναι τεράστια μηχανήματα που καταλαμβάνουν ολόκληρα δωμάτια και μπορούν να επεξεργαστούν τεράστιο όγκο δεδομένων που δεν μπορεί να συγκριθεί με τους υπολογιστές που έχουμε στην καθημερινότητά μας. Χρησιμοποιούνται για την δημιουργία χαρτών του σύμπαντος, την μελέτη των κλιματικών αλλαγών, προσομοίωση πυρηνικών και άλλων όπλων, έρευνες για πετρέλαιο, ανάλυση DNA κλπ. H συνολική ισχύς των 500 ισχυρότερων συστημάτων αγγίζει τα 845 petaflops έναντι 749 petaflops πριν έξι μήνες και 672 petaflops το 2016. Από αυτή τη συνολική ισχύ, το 35,4% ανήκει στην Κίνα και το 29,6% στις ΗΠΑ. To όριο για να συμπεριληφθεί ένας υπερυπολογιστής στο Top 500, έχει αυξηθεί στα 548 teraflops από 432 teraflops τον Ιούνιο. Στον συμπληρωματικό κατάλογο Top Green 500 με τους πιο «πράσινους» και λιγότερο ενεργοβόρους υπερυπολογιστές προηγούνται τρεις από την Ιαπωνία.';
templateArticle.Author= 'Λορένα Σιούτη';
templateArticle.Date= '16/11/2017';
templateArticle.SourceWebsite= 'www.techblog.gr';
templateArticle.Category= 'Technology';

templateArticles.push(templateArticle);
